using System;
using System.IO;

/*
 * Создать классы по работе в файловом менеджере. Файл/папка/интерфейс пользователя
 * */

namespace FileManager
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Консольный файловый менеджер");

            
        }
    }
}
